from typing import List, Dict

schedule: List[Dict[str, List[str]]] = [
    {
        "12:55-14:15": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "14:30-15:50": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "16:05-17:25": [
            "Корпоративні технології Java (Горбенко)",
            "Корпоративні технології Java (Горбенко)",
        ],
    },
    {
        "14:30-15:50": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "16:05-17:25": [
            "Автоматизоване тестування (Кудін)",
            "Автоматизоване тестування (Кудін)",
        ],
        "17:40-18:00": [
            "Корпоративні технології Java (Горбенко)",
            "Основи використання хмарних ресурсів (Лісняк)",
        ],
    },
    {},
    {
        "12:55-14:15": [
            "Автоматизоване тестування (Лебідь)",
            "Автоматизоване тестування (Лебідь)",
        ],
        "14:30-15:50": [
            "Основи використання хмарних ресурсів (Ракша)",
            "Основи використання хмарних ресурсів (Ракша)",
        ],
        "16:05-17:25": [
            "Основи використання хмарних ресурсів (Ракша)",
            "Корпоративні технології Java (Горбенко)",
        ],
    },
    {},
    {},  # Saturday (weekend)
    {},  # Sunday (weekend)
]
