from typing import List, Dict

schedule: List[Dict[str, List[str]]] = [
    {
        "08:00-09:20": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "09:30-10:50": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "11:00-12:20": [
            "Корпоративні технології Java (Горбенко)",
            "Корпоративні технології Java (Горбенко)",
        ],
    },
    {
        "08:00-09:20": [
            "Професійно орієнтована підготовка (Мухін)",
            "Професійно орієнтована підготовка (Мухін)",
        ],
        "09:30-10:50": [
            "Автоматизоване тестування (Кудін)",
            "Автоматизоване тестування (Кудін)",
        ],
        "11:00-12:20": [
            "Корпоративні технології Java (Горбенко)",
            "Основи використання хмарних ресурсів (Лісняк)",
        ],
    },
    {},
    {
        "08:00-09:20": [
            "Автоматизоване тестування (Лебідь)",
            "Автоматизоване тестування (Лебідь)",
        ],
        "09:30-10:50": [
            "Основи використання хмарних ресурсів (Ракша)",
            "Основи використання хмарних ресурсів (Ракша)",
        ],
        "11:00-12:20": [
            "Основи використання хмарних ресурсів (Ракша)",
            "Корпоративні технології Java (Горбенко)",
        ],
    },
    {},
    {},  # Saturday (weekend)
    {},  # Sunday (weekend)
]
